app/views/ratings/index.html.erb

SELECT "ratings".* FROM "ratings" WHERE "ratings"."user_id" = ?  [["user_id", 1]]
---
        <% end %>
		<td><%= user.ratings.count %></td>