app/controllers/beers_controller.rb

SELECT "beers".* FROM "beers"
SELECT "breweries".* FROM "breweries" WHERE "breweries"."id" IN (1, 2, 3)
SELECT "styles".* FROM "styles" WHERE "styles"."id" IN (1, 2, 3)
---
  def index
    @beers = Beer.includes(:brewery, :style).all

SELECT "breweries".* FROM "breweries"
SELECT "styles".* FROM "styles"
---
  def new
    @beer = Beer.new
    @breweries = Brewery.all
    @styles = Style.all

INSERT INTO "beers" ("name", "style_id", "brewery_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "CrapIPA"], ["style_id", 1], ["brewery_id", 1], ["created_at", "2016-03-03 16:24:00.939723"], ["updated_at", "2016-03-03 16:24:00.939723"]]
SELECT "breweries".* FROM "breweries"
SELECT "styles".* FROM "styles"
---
  def create
	#["beerlist-name", "beerlist-brewery", "beerlist-style"].each{ |f| expire_fragment(f) }
	#expire_fragment('beerlist')
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save
        format.html { redirect_to beers_path, notice: 'Beer was successfully created.' }
        format.json { render :show, status: :created, location: @beer }
      else
        @breweries = Brewery.all
        @styles = Style.all