app/controllers/ratings_controller.rb

SELECT "beers".* FROM "beers"
---
  def index
    @ratings = Rating.all
	@beers = Beer.all

INSERT INTO "ratings" ("score", "beer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["score", 15], ["beer_id", 1], ["created_at", "2016-03-03 16:24:02.604761"], ["updated_at", "2016-03-03 16:24:02.604761"]]
---
  def create
    Rating.create params.require(:rating).permit(:score, :beer_id)